### <span style="color:black"><b>Pandas Tutorial 2</b></span>

---

<ins>Understanding our Dataset</ins>

* Once we load in our dataset it is always nice to get some basic information about it
* Below are some simple pandas commands we can use to do this
* I'll also introduce the concept of a series and a dataframe

In [1]:
import pandas as pd

In [3]:
data = pd.read_csv('health.csv')
data.head()

,Country,Year,InfantMortality,Health_exp,Life_exp,GDP_cap,Employment,Status,MeanSchooling,ElectricityAccess
0,Albania,2000,24.1,7.233370,73.955000,1126.683318,52.090000,Developing,8.8,100.000000
1,United Arab Emirates,2000,9.6,2.374135,74.327000,33291.419366,74.250000,Developed,8.3,100.000000
2,Argentina,2000,17.5,8.466964,73.576000,7708.100996,52.580002,Developing,9.1,95.445366
3,Armenia,2000,27.0,4.195812,71.409000,622.742139,47.139999,Developing,10.8,98.900000
4,Australia,2000,5.1,7.613833,79.234146,21679.247842,59.389999,Developed,11.9,100.000000

In [4]:
data.shape

(2575, 10)

In [5]:
data.describe()

,Year,InfantMortality,Health_exp,Life_exp,GDP_cap,Employment,MeanSchooling,ElectricityAccess
count,2575.000000,2575.000000,2575.000000,2575.000000,2575.000000,2575.000000,2575.000000,2575.000000
mean,2009.234563,26.798951,6.157252,70.579504,13155.785444,58.730617,7.972117,78.910569
std,5.412521,26.101219,2.585380,8.880194,18848.945362,11.024063,3.300844,30.879275
min,2000.000000,1.600000,1.025159,43.467000,111.927224,33.020000,1.100000,1.300314
25%,2005.000000,6.300000,4.126215,65.535000,1258.635428,51.385000,5.200000,62.850000
50%,2009.000000,16.300000,5.824070,72.618000,4234.403133,58.020000,8.400000,98.560364
75%,2014.000000,40.950000,8.016386,77.444110,16502.849386,65.509998,10.800000,100.000000
max,2018.000000,128.200000,20.413412,84.210976,118823.648369,87.820000,14.100000,100.000000

In [6]:
data.describe(include = 'object')

        Country      Status
count      2575        2575
unique      144           2
top     Albania  Developing
freq         19        1891

In [7]:
data.columns

Index(['Country', 'Year', 'InfantMortality', 'Health_exp', 'Life_exp',
       'GDP_cap', 'Employment', 'Status', 'MeanSchooling',
       'ElectricityAccess'],
      dtype='object')

In [9]:
data.dtypes

Country               object
Year                   int64
InfantMortality      float64
Health_exp           float64
Life_exp             float64
GDP_cap              float64
Employment           float64
Status                object
MeanSchooling        float64
ElectricityAccess    float64
dtype: object

In [10]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2575 entries, 0 to 2574
Data columns (total 10 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Country            2575 non-null   object
 1   Year               2575 non-null   int64
 2   InfantMortality    2575 non-null   float64
 3   Health_exp         2575 non-null   float64
 4   Life_exp           2575 non-null   float64
 5   GDP_cap            2575 non-null   float64
 6   Employment         2575 non-null   float64
 7   Status             2575 non-null   object
 8   MeanSchooling      2575 non-null   float64
 9   ElectricityAccess  2575 non-null   float64
dtypes: float64(7), int64(1), object(2)
memory usage: 201.3+ KB

In [11]:
type(data)

pandas.core.frame.DataFrame

In [12]:
type(data.Year)

pandas.core.series.Series